index.org
#+TITLE: Fifteenth Summer School on Formal Techniques
#+SUBTITLE: May 23-29, 2026
#+AUTHOR: SSFT
#+LANGUAGE: en
#+EXPORT_FILE_NAME: index.html
#+OPTIONS: toc:1 num:nil

# Edit this file, then run `make build` to regenerate index.html.

* Overview
:PROPERTIES:
:CUSTOM_ID: overview
:END:

Techniques based on formal logic, such as model checking, satisfiability, static analysis, and automated theorem proving, are finding a broad range of applications in modeling, analysis, verification, and synthesis.

This school, the fifteenth in the series, focuses on the principles and practice of formal techniques, with a strong emphasis on the hands-on use and development of this technology. It primarily targets graduate students and young researchers who are interested in studying and using formal techniques in their research. A prior background in formal methods is helpful but not required.

Participants can expect to have a seriously fun time experimenting with the tools and techniques presented in the lectures during the laboratory sessions. The main lectures run from Monday, May 25 to Friday, May 29. They are preceded by a background course, /Speaking Logic/, on May 23 and 24.

Week-long lectures by:

- Aws Albarghouthi, /Compilers for Quantum Computers/
- Cas Cremers, /Analyzing Cryptographic Protocols with Tamarin/
- César Muñoz, /Developing and Proving Algorithms with PVS/
- Ruzica Piskac, /Privacy-Preserving Reasoning/
- Chris Hawblitzel, /Verifying Rust code with Verus/

* Lectures
:PROPERTIES:
:CUSTOM_ID: lecturers
:END:

** Compilers for Quantum Computers
:PROPERTIES:
:CUSTOM_ID: quantum-compilers
:END:

Aws Albarghouthi, University of Wisconsin-Madison

*Abstract.* Quantum computers have the potential to transform drug discovery, materials design, energy production, and beyond. Recent breakthroughs in physical implementations have brought this technology closer to reality. In this course, we will learn about the problem of compiling quantum programs to run on quantum processors. Even though state-of-the-art quantum computers are still experimental and small in scale, the compilation problem is critical for understanding the resources required for running different applications on different emerging hardware and architectures. The course begins with a brief introduction to quantum computing fundamentals and then transitions to two key phases of quantum compilation: circuit optimization, and mapping and routing.

*Bio.* Aws Albarghouthi is an associate professor of computer science at the University of Wisconsin-Madison. He works in programming languages and formal methods, developing new techniques for automatically building reliable and secure software systems. He received his PhD from the University of Toronto in 2015. He has received paper awards at PLDI, FSE, UIST, and FAST, an NSF CAREER award, and multiple industry awards from Meta, Google, and Amazon. He also received the Class of 1955 Teaching Excellence Award, one of the University of Wisconsin's highest teaching honors.

*Materials and references.*

- [[https://qqq-wisc.github.io/][Speaker's papers and tools on the topic]]
- [[https://quantum.country/][Quantum Country tutorial]]

** Analyzing Cryptographic Protocols with Tamarin
:PROPERTIES:
:CUSTOM_ID: tamarin
:END:

Prof. Dr. Cas Cremers, CISPA Helmholtz Center for Information Security

*Abstract.* The Tamarin prover is a state-of-the-art tool for cryptographic protocol analysis. Protocols are specified using multiset rewriting, and a subset of first-order logic is used to specify protocol properties. Tamarin then supports automated analysis of protocols with respect to their specified properties. Tamarin has a large user community and has been successfully used to analyze numerous industry protocols and standards, leading either to the discovery of subtle attacks or to automated proofs.

*Materials.* This tutorial explains how to use Tamarin to specify and reason about cryptographic protocols. Tamarin is open-source software; the manual, the Tamarin book, source code, and scientific papers are available at [[https://tamarin-prover.com/][tamarin-prover.com]]. For examples of its real-world use, see [[https://hal.archives-ouvertes.fr/hal-03586826/document][this report]].

** Developing and Proving Algorithms with PVS
:PROPERTIES:
:CUSTOM_ID: pvs
:END:

Dr. César Muñoz, NASA Langley Research Center

*Abstract.* These lectures provide a practical introduction to specifying, verifying, and validating algorithms using the Prototype Verification System (PVS), an interactive environment for system specification and verification. PVS features a strongly typed specification language based on higher-order logic, with a type system that supports predicate sub-types, dependent types, inductive data types, parametric types, prenex polymorphism, and built-in types and data structures such as numbers, booleans, strings, records, unions, tuples, arrays, sequences, sets, and lists.

The PVS theorem prover includes decision procedures for linear arithmetic, propositional logic, and temporal logic, and users can conservatively extend its deductive capabilities through custom proof strategies. NASALib is a comprehensive library of fundamental mathematics developed in PVS, along with utilities for proving and animating specifications. These lectures focus on the development and verification of algorithms through examples inspired by actual NASA verification projects. The lectures provide a gentle introduction to advanced PVS features, including induction-less induction, modeling with deep and shallow embeddings, and differential testing via model animation.

*Bio.* Dr. César Muñoz is a Research Computer Scientist at NASA, leading the Formal Methods Team at NASA Langley Research Center. He earned his PhD in Computer Science from the University of Paris 7, currently Paris Cite University, in France. Dr. Muñoz began his NASA career as a contractor in 1999 before transitioning to a civil servant role in 2009. Between 2021 and 2023, he served as Senior Principal Applied Scientist at Amazon Web Services, managing the S3 Automated Reasoning Team. He returned to NASA in 2023 to advance the development and application of formal methods for designing, analyzing, implementing, and verifying safety-critical systems relevant to NASA missions.

Dr. Muñoz is a recognized expert in SRI's Prototype Verification System and has developed numerous strategies, libraries, and utilities for PVS, which are publicly available. His contributions to PVS include Interval Arithmetic, ACCoRD, PVSio, ProofLite, and Extrategies.

