index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Generated from Org source -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fifteenth Summer School on Formal Techniques</title>
<meta name="author" content="SSFT" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css" />
</head>
<body>
<main id="content" class="content">
<header>
<h1 class="title">Fifteenth Summer School on Formal Techniques</h1>
<p class="subtitle" role="doc-subtitle">May 23-29, 2026</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#overview">Overview</a></li>
<li><a href="#lecturers">Lectures</a></li>
<li><a href="#invited">Invited Speakers</a></li>
<li><a href="#splogic">Speaking Logic</a></li>
<li><a href="schedule.html">Schedule</a></li>
<li><a href="#prev">Previous Summer Schools</a></li>
<li><a href="#registration">Registration</a></li>
</ul>
</div>
</nav>

<div id="outline-container-overview" class="outline-2">
<h2 id="overview">Overview</h2>
<div class="outline-text-2" id="text-overview">
<p>
Techniques based on formal logic, such as model checking, satisfiability, static analysis, and automated theorem proving, are finding a broad range of applications in modeling, analysis, verification, and synthesis.
</p>

<p>
This school, the fifteenth in the series, focuses on the principles and practice of formal techniques, with a strong emphasis on the hands-on use and development of this technology. It primarily targets graduate students and young researchers who are interested in studying and using formal techniques in their research. A prior background in formal methods is helpful but not required.
</p>

<p>
Participants can expect to have a seriously fun time experimenting with the tools and techniques presented in the lectures during the laboratory sessions. The main lectures run from Monday, May 25 to Friday, May 29. They are preceded by a background course, <i>Speaking Logic</i>, on May 23 and 24.
</p>

<p>
Week-long lectures by:
</p>

<ul class="org-ul">
<li>Aws Albarghouthi, <i>Compilers for Quantum Computers</i></li>
<li>Cas Cremers, <i>Analyzing Cryptographic Protocols with Tamarin</i></li>
<li>Cesar Munoz, <i>Developing and Proving Algorithms with PVS</i></li>
<li>Ruzica Piskac, <i>Privacy-Preserving Reasoning</i></li>
<li>Chris Hawblitzel, <i>Verifying Rust code with Verus</i></li>
</ul>
</div>
</div>

<div id="outline-container-lecturers" class="outline-2">
<h2 id="lecturers">Lectures</h2>
<div class="outline-text-2" id="text-lecturers">
</div>

<div id="outline-container-quantum-compilers" class="outline-3">
<h3 id="quantum-compilers">Compilers for Quantum Computers</h3>
<div class="outline-text-3" id="text-quantum-compilers">
<p>
Aws Albarghouthi, University of Wisconsin-Madison
</p>

<p>
<b>Abstract.</b> Quantum computers have the potential to transform drug discovery, materials design, energy production, and beyond. Recent breakthroughs in physical implementations have brought this technology closer to reality. In this course, we will learn about the problem of compiling quantum programs to run on quantum processors. Even though state-of-the-art quantum computers are still experimental and small in scale, the compilation problem is critical for understanding the resources required for running different applications on different emerging hardware and architectures. The course begins with a brief introduction to quantum computing fundamentals and then transitions to two key phases of quantum compilation: circuit optimization, and mapping and routing.
</p>

<p>
<b>Bio.</b> Aws Albarghouthi is an associate professor of computer science at the University of Wisconsin-Madison. He works in programming languages and formal methods, developing new techniques for automatically building reliable and secure software systems. He received his PhD from the University of Toronto in 2015. He has received paper awards at PLDI, FSE, UIST, and FAST, an NSF CAREER award, and multiple industry awards from Meta, Google, and Amazon. He also received the Class of 1955 Teaching Excellence Award, one of the University of Wisconsin&rsquo;s highest teaching honors.
</p>

<p>
<b>Materials and references.</b>
</p>

<ul class="org-ul">
<li><a href="https://qqq-wisc.github.io/">Speaker&rsquo;s papers and tools on the topic</a></li>
<li><a href="https://quantum.country/">Quantum Country tutorial</a></li>
</ul>
</div>
</div>

<div id="outline-container-tamarin" class="outline-3">
<h3 id="tamarin">Analyzing Cryptographic Protocols with Tamarin</h3>
<div class="outline-text-3" id="text-tamarin">
<p>
Prof. Dr. Cas Cremers, CISPA Helmholtz Center for Information Security
</p>

<p>
<b>Abstract.</b> The Tamarin prover is a state-of-the-art tool for cryptographic protocol analysis. Protocols are specified using multiset rewriting, and a subset of first-order logic is used to specify protocol properties. Tamarin then supports automated analysis of protocols with respect to their specified properties. Tamarin has a large user community and has been successfully used to analyze numerous industry protocols and standards, leading either to the discovery of subtle attacks or to automated proofs.
</p>

<p>
<b>Materials.</b> This tutorial explains how to use Tamarin to specify and reason about cryptographic protocols. Tamarin is open-source software; the manual, the Tamarin book, source code, and scientific papers are available at <a href="https://tamarin-prover.com/">tamarin-prover.com</a>. For examples of its real-world use, see <a href="https://hal.archives-ouvertes.fr/hal-03586826/document">this report</a>.
</p>
</div>
</div>

<div id="outline-container-pvs" class="outline-3">
<h3 id="pvs">Developing and Proving Algorithms with PVS</h3>
<div class="outline-text-3" id="text-pvs">
<p>
Dr. Cesar Munoz, NASA Langley Research Center
</p>

<p>
<b>Abstract.</b> These lectures provide a practical introduction to specifying, verifying, and validating algorithms using the Prototype Verification System (PVS), an interactive environment for system specification and verification. PVS features a strongly typed specification language based on higher-order logic, with a type system that supports predicate sub-types, dependent types, inductive data types, parametric types, prenex polymorphism, and built-in types and data structures such as numbers, booleans, strings, records, unions, tuples, arrays, sequences, sets, and lists.
</p>

<p>
The PVS theorem prover includes decision procedures for linear arithmetic, propositional logic, and temporal logic, and users can conservatively extend its deductive capabilities through custom proof strategies. NASALib is a comprehensive library of fundamental mathematics developed in PVS, along with utilities for proving and animating specifications. These lectures focus on the development and verification of algorithms through examples inspired by actual NASA verification projects. The lectures provide a gentle introduction to advanced PVS features, including induction-less induction, modeling with deep and shallow embeddings, and differential testing via model animation.
</p>

<p>
<b>Bio.</b> Dr. Cesar Munoz is a Research Computer Scientist at NASA, leading the Formal Methods Team at NASA Langley Research Center. He earned his PhD in Computer Science from the University of Paris 7, currently Paris Cite University, in France. Dr. Munoz began his NASA career as a contractor in 1999 before transitioning to a civil servant role in 2009. Between 2021 and 2023, he served as Senior Principal Applied Scientist at Amazon Web Services, managing the S3 Automated Reasoning Team. He returned to NASA in 2023 to advance the development and application of formal methods for designing, analyzing, implementing, and verifying safety-critical systems relevant to NASA missions.
</p>

<p>
Dr. Munoz is a recognized expert in SRI&rsquo;s Prototype Verification System and has developed numerous strategies, libraries, and utilities for PVS, which are publicly available. His contributions to PVS include Interval Arithmetic, ACCoRD, PVSio, ProofLite, and Extrategies.
</p>
</div>
</div>
