index.html

<div id="outline-container-privacy-reasoning" class="outline-3">
<h3 id="privacy-reasoning">Privacy-Preserving Reasoning</h3>
<div class="outline-text-3" id="text-privacy-reasoning">
<p>
Prof. Ruzica Piskac, Yale University
</p>

<p>
<b>Abstract.</b> Formal methods offer a vast collection of techniques to analyze and ensure the correctness of software and hardware systems against a given specification. Modern formal methods tools scale to industrial applications, but privacy requirements are not usually considered in their design. For example, automated reasoning tools often assume that the formula to be proved is public, which is a problem if the formula itself reveals information that should remain private to one party. To overcome this issue, we propose privacy-preserving automated reasoning.
</p>

<p>
In these lectures, students will learn how to incorporate cryptographic primitives into automated reasoning. We will present a privacy-preserving Boolean satisfiability solver that allows mutually distrustful parties to evaluate the conjunction of their input formulas while maintaining privacy. We will also show how to prove unsatisfiability of formulas using zero-knowledge protocols, and discuss how the full formal verification workflow can be applied in privacy-preserving settings.
</p>

<p>
<b>Bio.</b> Ruzica Piskac is a Professor of Computer Science at Yale University, where she leads the Rigorous Software Engineering (ROSE) group. Her research interests span software verification, security and applied cryptography, automated reasoning, and code synthesis. Much of her research has focused on using formal techniques to improve software reliability and trustworthiness. Piskac joined Yale&rsquo;s Department of Computer Science in 2013. She was previously an Independent Research Group Leader at the Max Planck Institute for Software Systems in Germany.
</p>

<p>
Her research has received a range of professional honors, including multiple Amazon Research Awards, Yale University&rsquo;s Ackerman Award for Teaching and Mentoring, the Facebook Communications and Networking Award, and the Microsoft Research Award for the Software Engineering Innovation Foundation. In 2019, Yale named Piskac the Donna L. Dubinsky Associate Professor of Computer Science. Piskac holds a PhD from the Swiss Federal Institute of Technology, EPFL, where her dissertation won the Patrick Denantes Prize. Her current and recent professional activities include service as Program Chair of the 37th International Conference on Computer Aided Verification and on the Steering Committee of the Formal Methods in Computer-Aided Design conference. Piskac has graduated six PhD students, four of whom are now faculty members.
</p>
</div>
</div>

<div id="outline-container-verus" class="outline-3">
<h3 id="verus">Verifying Rust Code with Verus</h3>
<div class="outline-text-3" id="text-verus">
<p>
Dr. Chris Hawblitzel, Microsoft Research
</p>

<p>
<b>Abstract.</b> The Rust programming language is rapidly gaining acceptance as a modern, type-safe alternative to C and C++ for low-level systems programming. Rust includes an advanced type system, similar to languages like Haskell and ML, that makes formal reasoning more elegant and natural. Most importantly, Rust implements a novel ownership checker that manages aliasing and mutation, allowing safe manual deallocation of unaliased values and prohibiting mutation of aliased values. This ownership methodology is ideal for formal verification: it allows a verifier to reason about values rather than mutable heap locations, making verification of Rust code similar to verification of purely functional high-level languages.
</p>

<p>
This course introduces Verus, a verifier for Rust code. With Verus, programmers express proofs and specifications using Rust, allowing proofs to take advantage of Rust&rsquo;s type checking and ownership checking. The course describes how to write such specifications and proofs, and how the Verus tool translates them into formulas that can be efficiently checked by an SMT solver. It also describes how to write proofs that take advantage of Rust&rsquo;s ownership to express separation and permissions in a style similar to separation logic, and how to use this style to verify safe Rust code, unsafe Rust code, and concurrent Rust code.
</p>

<p>
The course includes both lectures and hands-on exercises. Students can install Verus on any Linux, MacOS, or Windows laptop to edit and verify Rust code during the course. No knowledge of Rust is required beforehand.
</p>

<p>
<b>Bio.</b> Chris Hawblitzel is a Senior Principal Researcher at Microsoft Research in Redmond, WA. His research focuses on using programming language techniques and formal verification to enforce the safety and security of systems software. He has worked on projects including the Singularity OS, the Verve verified OS, the Ironclad/IronFleet verified software stack, the Everest verified TLS project, and the Verus verifier for Rust.
</p>

<p>
He has co-authored papers receiving best paper awards for Verve at PLDI and Verus at OSDI, a CACM research highlight for IronFleet, distinguished paper awards for Vale at USENIX Security and Linear Dafny at OOPSLA, and distinguished artifact awards for Verus-related projects at SOSP, OSDI, and OOPSLA. He received a BA in physics from UC Berkeley in 1993, received a PhD in computer science from Cornell in 2000, taught at Dartmouth College until 2004, and has been a researcher at Microsoft Research since 2005.
</p>
</div>
</div>
</div>

<div id="outline-container-invited" class="outline-2">
<h2 id="invited">Invited Speakers</h2>
<div class="outline-text-2" id="text-invited">
</div>

<div id="outline-container-mohsen" class="outline-3">
<h3 id="mohsen">Verified Distributed System Generation</h3>
<div class="outline-text-3" id="text-mohsen">
<p>
Prof. Mohsen Lesani, UC Santa Cruz
</p>

<p>
<b>Abstract</b> Distributed systems underpin modern computing. Yet, building distributed systems and interfaces with strong reliability and security guarantees remains elusive. This talk presents our cross-stack research on the automatic generation and verification of distributed systems. I will describe two projects: Hamsaz and Hamraz. Given a class of data objects such as a relational schema annotated with integrity and recency requirements, Hamsaz automatically generates a correct-by-construction replicated class that guarantees integrity, convergence and recency, while minimizing coordination overhead. Given an online service as a class of objects and its end-to-end confidentiality, integrity and availability policies, Hamraz applies information flow type inference to automatically partition, place and replicate the fields and methods of the class across quorum systems, and synthesize trustworthy-by-construction distributed systems. Finally, I will close with an overview of our ongoing work on LLM-assisted generation of verified distributed systems.
</p>

<p>
<b>Bio.</b> Mohsen Lesani is an Associate Professor in the Department of Computer Science and Engineering at the University of California, Santa Cruz, currently on sabbatical at UC Berkeley. He was a postdoctoral researcher at MIT and received his PhD from UCLA. His research spans formal methods and distributed systems. He received the NSF CAREER Award in 2020 and the DARPA YFA in 2022. His research has been recognized as a SIGPLAN Research Highlight and received a distinguished paper award at OOPSLA.
</p>
</div>
</div>
</div>
