index.org
* Speaking Logic
:PROPERTIES:
:CUSTOM_ID: splogic
:END:

Natarajan Shankar and Stéphane Graham-Lengrand, SRI CSL

Formal logic has become the lingua franca of computing. It is used for specifying digital systems, annotating programs with assertions, defining the semantics of programming languages, and proving or refuting claims about software or hardware systems. Familiarity with the language and methods of logic is a foundation for research into formal aspects of computing. This course covers the basics of logic, focusing on the use of logic as a medium for formalization and proof.

- [[file:materials/speaklogicV14.pdf][Speaking Logic]]
- Videos: [[https://youtu.be/2rlabN32Ff4][Speaking Logic Part 1 (2021)]], [[https://youtu.be/gpyC83VJ2OE][Propositional Logic]]
- [[file:materials/PVSTutorial.pdf][PVS Tutorial (WIFT'95)]]
- [[file:materials/PVScourse.pdf][Specification and Proof with PVS]]
- [[file:materials/TypeTheory.pdf][Type Theory]]
- [[file:materials/vscode-pvs-tutorial.pdf][VSCode-PVS Tutorial]] and [[https://youtu.be/dYI7kypymvI][VSCode-PVS Video]]
- [[https://github.com/nasa/vscode-pvs/tree/pvs8/releases][VSCode-PVS for Mac instructions]]
- [[file:old/2025/materials/SSFT25PVS.tgz][PVS exercises]]

** PVS Documentation
:PROPERTIES:
:CUSTOM_ID: pvs-documentation
:END:

- [[https://pvs.csl.sri.com/doc/pvs-language-reference.pdf][PVS Language Reference]]
- [[https://pvs.csl.sri.com/doc/pvs-system-guide.pdf][PVS System Guide]]
- [[https://pvs.csl.sri.com/doc/pvs-prover-guide.pdf][PVS Prover Guide]]
- [[https://pvs.csl.sri.com/doc/datatypes.pdf][PVS Datatypes]]
- [[https://pvs.csl.sri.com/doc/interpretations.pdf][PVS Theory Interpretations]]
- [[https://pvs.csl.sri.com/documentation.html][More PVS documentation]]


* Previous Summer Schools
:PROPERTIES:
:CUSTOM_ID: prev
:END:

Information about previous Summer Schools on Formal Techniques can be found at:

- [[http://ssft-sri.github.io/old/2025][SSFT25]]
- [[http://fm.csl.sri.com/SSFT24][SSFT24]]
- [[http://fm.csl.sri.com/SSFT23][SSFT23]]
- [[http://fm.csl.sri.com/SSFT22][SSFT22]]
- [[http://fm.csl.sri.com/SSFT21][SSFT21]]
- [[http://fm.csl.sri.com/SSFT19][SSFT19]]
- [[http://fm.csl.sri.com/SSFT18][SSFT18]]
- [[http://fm.csl.sri.com/SSFT17][SSFT17]]
- [[http://fm.csl.sri.com/SSFT16][SSFT16]]
- [[http://fm.csl.sri.com/SSFT15][SSFT15]]
- [[http://fm.csl.sri.com/SSFT14][SSFT14]]
- [[http://fm.csl.sri.com/SSFT13][SSFT13]]
- [[http://fm.csl.sri.com/SSFT12][SSFT12]]
- [[http://fm.csl.sri.com/SSFT11][SSFT11]]

Jay Bosamiya of CMU has [[https://www.jaybosamiya.com/blog/2018/05/31/ssft/][blogged about the 2018 Summer School]].

* Registration
:PROPERTIES:
:CUSTOM_ID: registration
:END:

Registration is available here:

- [[https://forms.gle/rhkCoe9XSnkAAq596][SSFT 2026 registration form]]

The 2026 Summer School on Formal Techniques will take place in a hybrid mode: the lectures and labs will be live-streamed and recorded. We strongly encourage in-person participation so that you can benefit from interactions outside the classroom. We have funding from NSF to cover transportation, food, and lodging expenses for selected US-based students. Non-student and non-US in-person participants are expected to cover their own transportation and will be charged a fee, around $150/day, to cover the cost of food and lodging.

Applicants are urged to submit their applications as early as possible, no later than March 31, 2026, since there are only a limited number of spaces available. Those needing invitation letters for visa purposes should complete their applications as early as possible. We strongly encourage the participation of women and under-represented minorities in the summer school. The Summer School follows the Title IX Sexual Misconduct & Sexual Harassment Policy & Procedures at [[https://menlo.edu/title-ix/][Menlo College]].
