index.html



<div id="outline-container-splogic" class="outline-2">
<h2 id="splogic">Speaking Logic</h2>
<div class="outline-text-2" id="text-splogic">
<p>
Natarajan Shankar and Stephane Graham-Lengrand, SRI CSL
</p>

<p>
Formal logic has become the lingua franca of computing. It is used for specifying digital systems, annotating programs with assertions, defining the semantics of programming languages, and proving or refuting claims about software or hardware systems. Familiarity with the language and methods of logic is a foundation for research into formal aspects of computing. This course covers the basics of logic, focusing on the use of logic as a medium for formalization and proof.
</p>

<ul class="org-ul">
<li><a href="materials/speaklogicV14.pdf">Speaking Logic</a></li>
<li>Videos: <a href="https://youtu.be/2rlabN32Ff4">Speaking Logic Part 1 (2021)</a>, <a href="https://youtu.be/gpyC83VJ2OE">Propositional Logic</a></li>
<li><a href="materials/PVSTutorial.pdf">PVS Tutorial (WIFT&rsquo;95)</a></li>
<li><a href="materials/PVScourse.pdf">Specification and Proof with PVS</a></li>
<li><a href="materials/TypeTheory.pdf">Type Theory</a></li>
<li><a href="materials/vscode-pvs-tutorial.pdf">VSCode-PVS Tutorial</a> and <a href="https://youtu.be/dYI7kypymvI">VSCode-PVS Video</a></li>
<li><a href="https://github.com/nasa/vscode-pvs/tree/pvs8/releases">VSCode-PVS for Mac instructions</a></li>
<li><a href="old/2025/materials/SSFT25PVS.tgz">PVS exercises</a></li>
</ul>
</div>

<div id="outline-container-pvs-documentation" class="outline-3">
<h3 id="pvs-documentation">PVS Documentation</h3>
<div class="outline-text-3" id="text-pvs-documentation">
<ul class="org-ul">
<li><a href="https://pvs.csl.sri.com/doc/pvs-language-reference.pdf">PVS Language Reference</a></li>
<li><a href="https://pvs.csl.sri.com/doc/pvs-system-guide.pdf">PVS System Guide</a></li>
<li><a href="https://pvs.csl.sri.com/doc/pvs-prover-guide.pdf">PVS Prover Guide</a></li>
<li><a href="https://pvs.csl.sri.com/doc/datatypes.pdf">PVS Datatypes</a></li>
<li><a href="https://pvs.csl.sri.com/doc/interpretations.pdf">PVS Theory Interpretations</a></li>
<li><a href="https://pvs.csl.sri.com/documentation.html">More PVS documentation</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-prev" class="outline-2">
<h2 id="prev">Previous Summer Schools</h2>
<div class="outline-text-2" id="text-prev">
<p>
Information about previous Summer Schools on Formal Techniques can be found at:
</p>

<ul class="org-ul">
<li><a href="http://ssft-sri.github.io/old/2025">SSFT25</a></li>
<li><a href="http://fm.csl.sri.com/SSFT24">SSFT24</a></li>
<li><a href="http://fm.csl.sri.com/SSFT23">SSFT23</a></li>
<li><a href="http://fm.csl.sri.com/SSFT22">SSFT22</a></li>
<li><a href="http://fm.csl.sri.com/SSFT21">SSFT21</a></li>
<li><a href="http://fm.csl.sri.com/SSFT19">SSFT19</a></li>
<li><a href="http://fm.csl.sri.com/SSFT18">SSFT18</a></li>
<li><a href="http://fm.csl.sri.com/SSFT17">SSFT17</a></li>
<li><a href="http://fm.csl.sri.com/SSFT16">SSFT16</a></li>
<li><a href="http://fm.csl.sri.com/SSFT15">SSFT15</a></li>
<li><a href="http://fm.csl.sri.com/SSFT14">SSFT14</a></li>
<li><a href="http://fm.csl.sri.com/SSFT13">SSFT13</a></li>
<li><a href="http://fm.csl.sri.com/SSFT12">SSFT12</a></li>
<li><a href="http://fm.csl.sri.com/SSFT11">SSFT11</a></li>
</ul>

<p>
Jay Bosamiya of CMU has <a href="https://www.jaybosamiya.com/blog/2018/05/31/ssft/">blogged about the 2018 Summer School</a>.
</p>
</div>
</div>

<div id="outline-container-registration" class="outline-2">
<h2 id="registration">Registration</h2>
<div class="outline-text-2" id="text-registration">
<p>
Registration is available here:
</p>

<ul class="org-ul">
<li><a href="https://forms.gle/rhkCoe9XSnkAAq596">SSFT 2026 registration form</a></li>
</ul>

<p>
The 2026 Summer School on Formal Techniques will take place in a hybrid mode: the lectures and labs will be live-streamed and recorded. We strongly encourage in-person participation so that you can benefit from interactions outside the classroom. We have funding from NSF to cover transportation, food, and lodging expenses for selected US-based students. Non-student and non-US in-person participants are expected to cover their own transportation and will be charged a fee, around $150/day, to cover the cost of food and lodging.
</p>

<p>
Applicants are urged to submit their applications as early as possible, no later than March 31, 2026, since there are only a limited number of spaces available. Those needing invitation letters for visa purposes should complete their applications as early as possible. We strongly encourage the participation of women and under-represented minorities in the summer school. The Summer School follows the Title IX Sexual Misconduct &amp; Sexual Harassment Policy &amp; Procedures at <a href="https://menlo.edu/title-ix/">Menlo College</a>.
</p>
</div>
</div>
</main>
</body>
</html>
